TRUNCATE TABLE public."analiz_zaim";

-- Вставка исходных данных (возвраты, проценты, привлечения)
INSERT INTO public."analiz_zaim"
("Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT "Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф"
FROM public."FinancialData"
WHERE "СтатьяУровень3" IN ('Возврат Займов', 'Проценты По Займам', 'Привлечение Займов');

-- Вставка накопленных тел займов на первое число каждого месяца с 2020-01-01 по 2026-12-01
INSERT INTO public."analiz_zaim"
("Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT 
    fd."Распределение",
    fd."Статья",
    fd."Сумма",
    dates.period_date AS "Период",
    fd."Признак",
    fd."Категория",
    fd."Проект",
    fd."Контрагент",
    fd."Тип Кошелька",
    fd."Кошелек",
    fd."Комментарии",
    fd."Поток",
    fd."P&L",
    fd."UE",
    'Тело займа' AS "СтатьяУровень3",
    fd."п_ф"
FROM public."FinancialData" fd
CROSS JOIN (
    -- Генерируем первое число каждого месяца с января 2020 по декабрь 2026
    SELECT generate_series('2020-01-01'::date, '2026-12-01'::date, '1 month'::interval)::date AS period_date
) dates
WHERE fd."СтатьяУровень3" IN ('Возврат Займов', 'Привлечение Займов')
  AND fd."Период" <= dates.period_date
  and fd."п_ф"='факт'; 

  
  
INSERT INTO public."analiz_zaim"
("Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT "Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", 'план' as "п_ф"
FROM public."FinancialData"
WHERE "СтатьяУровень3" IN ('Тело займа') and "п_ф"='факт' and "Период"='2025-12-01';


-- Вставка накопленных тел займов на первое число каждого месяца с 2020-01-01 по 2026-12-01
INSERT INTO public."analiz_zaim"
("Распределение", "Статья", "Сумма", "Период", "Признак", "Категория", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Комментарии", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT 
    fd."Распределение",
    fd."Статья",
    fd."Сумма",
    dates.period_date AS "Период",
    fd."Признак",
    fd."Категория",
    fd."Проект",
    fd."Контрагент",
    fd."Тип Кошелька",
    fd."Кошелек",
    fd."Комментарии",
    fd."Поток",
    fd."P&L",
    fd."UE",
    'Тело займа' AS "СтатьяУровень3",
    fd."п_ф"
FROM public."FinancialData" fd
CROSS JOIN (
    -- Генерируем первое число каждого месяца с января 2020 по декабрь 2026
    SELECT generate_series('2026-01-01'::date, '2026-12-01'::date, '1 month'::interval)::date AS period_date
) dates
WHERE fd."СтатьяУровень3" IN ('Возврат Займов', 'Привлечение Займов')
  AND fd."Период" <= dates.period_date
  and fd."п_ф"='план'; 

