TRUNCATE TABLE public."analiz_кошелек";

-- Вставка исходных данных (возвраты, проценты, привлечения)
INSERT INTO public."analiz_кошелек"
("Распределение", "Сумма", "Период", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")

SELECT "Распределение", sum("Сумма") as "Сумма", "Период", 'Оборот кошелек' as "Проект", 'Оборот кошелек' as "Контрагент", "Тип Кошелька", "Кошелек", 'Оборот кошелек' as "Поток", 'Оборот кошелек' as "P&L", 'Оборот кошелек' as "UE", 'Оборот кошелек' as "СтатьяУровень3", "п_ф"
FROM public."FinancialData"

where "Распределение"='до распределения'

group by "Распределение", "Период",  "Тип Кошелька", "Кошелек",  "п_ф"
;

-- Вставка накопленных тел займов на первое число каждого месяца с 2020-01-01 по 2026-12-01 (факт)
INSERT INTO public."analiz_кошелек"
("Распределение", "Сумма", "Период", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT 
    fd."Распределение",
    fd."Сумма",
    dates.period_date AS "Период",
    fd."Проект",
    fd."Контрагент",
    fd."Тип Кошелька",
    fd."Кошелек",
    fd."Поток",
    fd."P&L",
    fd."UE",
    'Тело займа' AS "СтатьяУровень3",
    fd."п_ф"
FROM public."analiz_кошелек" fd
CROSS JOIN (
    SELECT generate_series('2020-01-01'::date, '2026-12-01'::date, '1 month'::interval)::date AS period_date
) dates
WHERE 
  fd."Период" <= dates.period_date
  AND fd."п_ф" = 'факт';

-- Перенос тела займа на 2024-12-01 как стартовая точка для плана
INSERT INTO public."analiz_кошелек"
("Распределение", "Сумма", "Период", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT "Распределение", "Сумма", "Период", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Поток", "P&L", "UE", "СтатьяУровень3", 'план' AS "п_ф"
FROM public."analiz_кошелек"
WHERE "СтатьяУровень3" IN ('Остаток кошелек') 
  AND "п_ф" = 'факт' 
  AND "Период" = '2025-12-01';

-- Вставка накопленных тел займов на первое число каждого месяца за 2026 год (план)
INSERT INTO public."analiz_кошелек"
("Распределение", "Сумма", "Период", "Проект", "Контрагент", "Тип Кошелька", "Кошелек", "Поток", "P&L", "UE", "СтатьяУровень3", "п_ф")
SELECT 
    fd."Распределение",
    fd."Сумма",
    dates.period_date AS "Период",
    fd."Проект",
    fd."Контрагент",
    fd."Тип Кошелька",
    fd."Кошелек",
    fd."Поток",
    fd."P&L",
    fd."UE",
    'Тело займа' AS "СтатьяУровень3",
    fd."п_ф"
FROM public."analiz_кошелек" fd
CROSS JOIN (
    SELECT generate_series('2026-01-01'::date, '2026-12-01'::date, '1 month'::interval)::date AS period_date
) dates
WHERE fd."Период" <= dates.period_date
  AND fd."п_ф" = 'план';
